apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_xspi.h
#define XSPI_WPCCR_IMODE_SHIFT       (0)       /* Instruction mode */
#define XSPI_WPCCR_IMODE_MASK        (7 << XSPI_WPCCR_IMODE_SHIFT)
#  define XSPI_WPCCR_IMODE(n)        ((n) << XSPI_WPCCR_IMODE_SHIFT)
#define XSPI_WPCCR_IDTR              (1 << 3)  /* Instruction DTR */
#define XSPI_WPCCR_ISIZE_SHIFT       (4)       /* Instruction size */
#define XSPI_WPCCR_ISIZE_MASK        (3 << XSPI_WPCCR_ISIZE_SHIFT)
#  define XSPI_WPCCR_ISIZE(n)        ((n) << XSPI_WPCCR_ISIZE_SHIFT)
#define XSPI_WPCCR_ADMODE_SHIFT      (8)       /* Address mode */
#define XSPI_WPCCR_ADMODE_MASK       (7 << XSPI_WPCCR_ADMODE_SHIFT)
#  define XSPI_WPCCR_ADMODE(n)       ((n) << XSPI_WPCCR_ADMODE_SHIFT)
#define XSPI_WPCCR_ADDTR             (1 << 11) /* Address DTR */
#define XSPI_WPCCR_ADSIZE_SHIFT      (12)      /* Address size */
#define XSPI_WPCCR_ADSIZE_MASK       (3 << XSPI_WPCCR_ADSIZE_SHIFT)
#  define XSPI_WPCCR_ADSIZE(n)       ((n) << XSPI_WPCCR_ADSIZE_SHIFT)
#define XSPI_WPCCR_ABMODE_SHIFT      (16)      /* Alternate bytes mode */
#define XSPI_WPCCR_ABMODE_MASK       (7 << XSPI_WPCCR_ABMODE_SHIFT)
#  define XSPI_WPCCR_ABMODE(n)       ((n) << XSPI_WPCCR_ABMODE_SHIFT)
#define XSPI_WPCCR_ABDTR             (1 << 19) /* Alternate bytes DTR */
#define XSPI_WPCCR_ABSIZE_SHIFT      (20)      /* Alternate bytes size */
#define XSPI_WPCCR_ABSIZE_MASK       (3 << XSPI_WPCCR_ABSIZE_SHIFT)
#  define XSPI_WPCCR_ABSIZE(n)       ((n) << XSPI_WPCCR_ABSIZE_SHIFT)
#define XSPI_WPCCR_DMODE_SHIFT       (24)      /* Data mode */
#define XSPI_WPCCR_DMODE_MASK        (7 << XSPI_WPCCR_DMODE_SHIFT)
#  define XSPI_WPCCR_DMODE(n)        ((n) << XSPI_WPCCR_DMODE_SHIFT)
#define XSPI_WPCCR_DDTR              (1 << 27) /* Data DTR */
#define XSPI_WPCCR_DQSE              (1 << 29) /* DQS enable */

#define XSPI_WPTCR_DCYC_SHIFT        (0)       /* Dummy cycles */
#define XSPI_WPTCR_DCYC_MASK         (31 << XSPI_WPTCR_DCYC_SHIFT)
#  define XSPI_WPTCR_DCYC(n)         ((n) << XSPI_WPTCR_DCYC_SHIFT)
#define XSPI_WPTCR_DHQC              (1 << 28) /* Delay hold quarter cycle */
#define XSPI_WPTCR_SSHIFT            (1 << 30) /* Sample shift */

#define XSPI_WPIR_INSTRUCTION_SHIFT  (0) /* Instruction */
#define XSPI_WPIR_INSTRUCTION_MASK   (0xffffffff << XSPI_WPIR_INSTRUCTION_SHIFT)
#define XSPI_WPABR_ALTERNATE_SHIFT   (0) /* Alternate bytes */
#define XSPI_WPABR_ALTERNATE_MASK    (0xffffffff << XSPI_WPABR_ALTERNATE_SHIFT)

/* Write communication and timing registers *********************************/

#define XSPI_WCCR_IMODE_SHIFT        (0)       /* Instruction mode */
#define XSPI_WCCR_IMODE_MASK         (7 << XSPI_WCCR_IMODE_SHIFT)
#  define XSPI_WCCR_IMODE(n)         ((n) << XSPI_WCCR_IMODE_SHIFT)
#define XSPI_WCCR_IDTR               (1 << 3)  /* Instruction DTR */
#define XSPI_WCCR_ISIZE_SHIFT        (4)       /* Instruction size */
#define XSPI_WCCR_ISIZE_MASK         (3 << XSPI_WCCR_ISIZE_SHIFT)
#  define XSPI_WCCR_ISIZE(n)         ((n) << XSPI_WCCR_ISIZE_SHIFT)
#define XSPI_WCCR_ADMODE_SHIFT       (8)       /* Address mode */
#define XSPI_WCCR_ADMODE_MASK        (7 << XSPI_WCCR_ADMODE_SHIFT)
#  define XSPI_WCCR_ADMODE(n)        ((n) << XSPI_WCCR_ADMODE_SHIFT)
#define XSPI_WCCR_ADDTR              (1 << 11) /* Address DTR */
#define XSPI_WCCR_ADSIZE_SHIFT       (12)      /* Address size */
#define XSPI_WCCR_ADSIZE_MASK        (3 << XSPI_WCCR_ADSIZE_SHIFT)
#  define XSPI_WCCR_ADSIZE(n)        ((n) << XSPI_WCCR_ADSIZE_SHIFT)
#define XSPI_WCCR_ABMODE_SHIFT       (16)      /* Alternate bytes mode */
#define XSPI_WCCR_ABMODE_MASK        (7 << XSPI_WCCR_ABMODE_SHIFT)
#  define XSPI_WCCR_ABMODE(n)        ((n) << XSPI_WCCR_ABMODE_SHIFT)
#define XSPI_WCCR_ABDTR              (1 << 19) /* Alternate bytes DTR */
#define XSPI_WCCR_ABSIZE_SHIFT       (20)      /* Alternate bytes size */
#define XSPI_WCCR_ABSIZE_MASK        (3 << XSPI_WCCR_ABSIZE_SHIFT)
#  define XSPI_WCCR_ABSIZE(n)        ((n) << XSPI_WCCR_ABSIZE_SHIFT)
#define XSPI_WCCR_DMODE_SHIFT        (24)      /* Data mode */
#define XSPI_WCCR_DMODE_MASK         (7 << XSPI_WCCR_DMODE_SHIFT)
#  define XSPI_WCCR_DMODE(n)         ((n) << XSPI_WCCR_DMODE_SHIFT)
#define XSPI_WCCR_DDTR               (1 << 27) /* Data DTR */
#define XSPI_WCCR_DQSE               (1 << 29) /* DQS enable */

#define XSPI_WTCR_DCYC_SHIFT         (0) /* Dummy cycles */
#define XSPI_WTCR_DCYC_MASK          (31 << XSPI_WTCR_DCYC_SHIFT)
#  define XSPI_WTCR_DCYC(n)          ((n) << XSPI_WTCR_DCYC_SHIFT)

#define XSPI_WIR_INSTRUCTION_SHIFT   (0) /* Instruction */
#define XSPI_WIR_INSTRUCTION_MASK    (0xffffffff << XSPI_WIR_INSTRUCTION_SHIFT)
#define XSPI_WABR_ALTERNATE_SHIFT    (0) /* Alternate bytes */
#define XSPI_WABR_ALTERNATE_MASK     (0xffffffff << XSPI_WABR_ALTERNATE_SHIFT)

/* HyperBus latency register ************************************************/

#define XSPI_HLCR_LM                 (1 << 0) /* Latency mode */
#define XSPI_HLCR_WZL                (1 << 1) /* Write zero latency */
#define XSPI_HLCR_TACC_SHIFT         (8)      /* Access time */
#define XSPI_HLCR_TACC_MASK          (0xff << XSPI_HLCR_TACC_SHIFT)
#define XSPI_HLCR_TRWR_SHIFT         (16)     /* Read write recovery time */
#define XSPI_HLCR_TRWR_MASK          (0xff << XSPI_HLCR_TRWR_SHIFT)

/* Calibration registers ****************************************************/

#define XSPI_CALFCR_FINE_SHIFT       (0)       /* Fine calibration */
#define XSPI_CALFCR_FINE_MASK        (0x7f << XSPI_CALFCR_FINE_SHIFT)
#  define XSPI_CALFCR_FINE(n)        ((n) << XSPI_CALFCR_FINE_SHIFT)
#define XSPI_CALFCR_COARSE_SHIFT     (16)      /* Coarse calibration */
#define XSPI_CALFCR_COARSE_MASK      (31 << XSPI_CALFCR_COARSE_SHIFT)
#  define XSPI_CALFCR_COARSE(n)      ((n) << XSPI_CALFCR_COARSE_SHIFT)
#define XSPI_CALFCR_CALMAX           (1 << 31) /* Calibration max value */

#define XSPI_CALMR_FINE_SHIFT        (0)  /* Fine calibration */
#define XSPI_CALMR_FINE_MASK         (0x7f << XSPI_CALMR_FINE_SHIFT)
#  define XSPI_CALMR_FINE(n)         ((n) << XSPI_CALMR_FINE_SHIFT)
#define XSPI_CALMR_COARSE_SHIFT      (16) /* Coarse calibration */
#define XSPI_CALMR_COARSE_MASK       (31 << XSPI_CALMR_COARSE_SHIFT)
#  define XSPI_CALMR_COARSE(n)       ((n) << XSPI_CALMR_COARSE_SHIFT)

#define XSPI_CALSOR_FINE_SHIFT       (0)  /* Fine calibration */
#define XSPI_CALSOR_FINE_MASK        (0x7f << XSPI_CALSOR_FINE_SHIFT)
#  define XSPI_CALSOR_FINE(n)        ((n) << XSPI_CALSOR_FINE_SHIFT)
#define XSPI_CALSOR_COARSE_SHIFT     (16) /* Coarse calibration */
#define XSPI_CALSOR_COARSE_MASK      (31 << XSPI_CALSOR_COARSE_SHIFT)
#  define XSPI_CALSOR_COARSE(n)      ((n) << XSPI_CALSOR_COARSE_SHIFT)

#define XSPI_CALSIR_FINE_SHIFT       (0)  /* Fine calibration */
#define XSPI_CALSIR_FINE_MASK        (0x7f << XSPI_CALSIR_FINE_SHIFT)
#  define XSPI_CALSIR_FINE(n)        ((n) << XSPI_CALSIR_FINE_SHIFT)
#define XSPI_CALSIR_COARSE_SHIFT     (16) /* Coarse calibration */
#define XSPI_CALSIR_COARSE_MASK      (31 << XSPI_CALSIR_COARSE_SHIFT)
#  define XSPI_CALSIR_COARSE(n)      ((n) << XSPI_CALSIR_COARSE_SHIFT)

/* XSPI I/O manager control register ****************************************/

#define XSPIM_CR_MUXEN               (1 << 0) /* Multiplexed mode */
#define XSPIM_CR_MODE                (1 << 1) /* Multiplexing mode */
#define XSPIM_CR_CSSEL_OVR_EN        (1 << 4) /* Chip-select override */
#define XSPIM_CR_CSSEL_OVR_O1        (1 << 5) /* XSPI1 uses nCS2 */
#define XSPIM_CR_CSSEL_OVR_O2        (1 << 6) /* XSPI2 uses nCS2 */
#define XSPIM_CR_REQ2ACK_SHIFT       (16)
#define XSPIM_CR_REQ2ACK_MASK        (0xff << XSPIM_CR_REQ2ACK_SHIFT)
#  define XSPIM_CR_REQ2ACK(n)        (((n) - 1) << XSPIM_CR_REQ2ACK_SHIFT)

#endif /* __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_XSPI_H */
